a = [1,2,3]
b = [4,5,6]
print(a+b)

c = ['a','b','c']
print(a+c) #타입이 다른 리스트도 + 연산 가능
temp = [1,2,3,'a','b','c']
print(temp)
print(a*2) # 곱한 숫자만큼 반복이 된다.

# print(a[2] + "hi") # 런타임 에러 발생
# print(3 + "hi")
print(a[2]) #인덱스로 지정할 경우에는 해당 요소의 고유의 타입으로 반환
print(a[2:]) # 슬라이싱 할 경우에는 리스트로 해당요소를 포함하여 반환

a = [1,2,3,'a','b','c']
print(a[3]+'hi')
print([1]+[2])
print("프로그램 종료")

####################################################################3
#리스트의 길이 구하기
a=[1,2,3]
print(len([1,2,3])) #a 의변수가 할당된 값으로 치환
print(3) # 수행의 결과로 치환


a[1] = 4
print(a)
print("프로그램 종료")    
