from idlelib.replace import replace
from itertools import count

from sphinx.addnodes import index

국어 = 80
영어 = 75
수학 = 90
과학 = 95

sum([국어,영어,수학,과학])
print(f"평균: {sum([국어,영어,수학,과학])/4}")

print('홀수 짝수 구별 프로그램')

num = 13

num % 2
print(f'홀수는1 짝수는 0: {num % 2}')

num = 16

print(f'홀수는1 짝수는 0: {num % 2}')

# 문제 3

홍길동 = '881120-1068234'
print(f"홍길동앞자리: {홍길동[:6]}")
print(f"홍길동뒷자리: {홍길동[7:]}")

#문제4

주민번호뒷자리첫번째 = 홍길동 [7]
print(f"주민번호 뒷자리 첫번째: {주민번호뒷자리첫번째}")

#문제5

문제5 = 'a:b:c:d'
문제5.replace(':','#')
print(f"문제5.replace(':','#'): {문제5.replace(':','#')}")

# 문제6
my_list = ['우리', '끝까지', '힘내요!']

# ' ' (공백)을 기준으로 리스트의 요소들을 합칩니다.
result = ' '.join(my_list)

print(result)

#문제7

문제7 = "Hello, World!"


print(f"문제7[:5]: {문제7[:5]}")

#문제8

문제8 = "Hello, World!"

문제8[-1]
print(f"문제8[-1]: {문제8[-1]}")


문제9 = " Hello, My Beautiful World!" 
문제9[-6]
print(f"문제9[-6]: {문제9[-6:]}")

#문제10

가사 = '너도 날 좋아할 줄은 몰랐어 어쩌면 좋아 너무나 좋아 꿈만 같아서 나 내 자신을 자꾸 꼬집어봐 너무나 좋아 니가 날 혹시 안 좋아할 까봐 혼자 얼마나 애태운지 몰라 그런데 니가 날 사랑한다니 어머 다시 한번 말해봐 텔미 텔미 테테테테테 텔미 나를 사랑한다고 날 기다려 왔다고 텔미 텔미 테테테테테 텔미 내가 필요하다 말해 말해줘요 텔미 텔미 테테테테테 텔미 자꾸만 듣고싶어 계속 내게 말해줘 텔미 텔미 테테테테테 텔미 꿈이 아니라고 말해 말해줘요 어쩜 내 가슴이 이렇게 뛰니 가슴이 정말 터질것같아 니가 날 볼때면 전기에 감전된 사람처럼 전기가 올라 얼마나 오래 기다린지 몰라 얼마나 오래 꿈꿨는지 몰라 그런데 니가 날 사랑한다니 어머 다시 한 번 말해봐 텔미 텔미 테테테테테 텔미 나를 사랑한다고 날 기다려 왔다고 텔미 텔미 테테테테테 텔미 내가 필요하다 말해 말해줘요 텔미 텔미 테테테테테 텔미 자꾸만 듣고싶어 계속 내게 말해줘 텔미 텔미 테테테테테 텔미 꿈이 아니라고 말해 말해줘요 힛 미 원 타임 베이비 다시한번 (텔미 텔미) 오케이 방금한건 알지만 또한번 (텔미 텔미) 요 계속 말해줘 들어도 들어도 듣고 싶어 어쩜 이런 일이 꿈인가 싶어 (어머) 어머나 좋아서 어쩌나 (다시 한 번 말해봐) 텔미 텔미 텔미 유 원미 원미 원미 투 텔미 텔미 텔미 유 럽 미 투 럽 미 투 얼마나 오래 기다린지 몰라 얼마나 오래 꿈꿨는지 몰라 그런데 니가 날 사랑한다니 어머 다시 한 번 말해봐 텔미 텔미 테테테테테 텔미 나를 사랑한다고 날 기다려 왔다고 텔미 텔미 테테테테테 텔미 내가 필요하다 말해 말해줘요 텔미 텔미 테테테테테 텔미 자꾸만 듣고싶어 계속 내게 말해줘 텔미 텔미 테테테테테 텔미 꿈이 아니라고 말해 말해줘요 텔미 텔미 테테테테테 텔미 테테테테테 텔미'
가사.count('텔미')

print(f"가사.count('텔미'): {가사.count('텔미')}")


